pipe/pipe/expansion/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.001;

vertices
(
    (0 0 0)              // 0
    (4.61 -0.2012769468 0)    // 1
    (4.61 0.2012769468 0)    // 2
    (0 0 400)              // 3
    (4.61 -0.2012769468 400)    // 4
    (4.61 0.2012769468 400)    // 5
    (7.15 -0.3121757418 400)// 6
    (7.15 0.3121757418 400)// 7
    (0 0 800)              // 8
    (4.61 -0.2012769468 800)    // 9
    (4.61 0.2012769468 800)    // 10
    (7.15 -0.3121757418 800)// 11
    (7.15 0.3121757418 800)// 12
);




blocks
(
    hex (0 1 2 0 3 4 5 3) (10 1 400) simpleGrading (1 1 1)         // 0
    hex (3 4 5 3 8 9 10 8) (10 1 400) simpleGrading (1 1 1)        // 1
    hex (4 6 7 5 9 11 12 10) (6 1 400) simpleGrading (1 1 1)      // 2 
);



boundary
(
    inlet
    {
        type patch;
        faces
        (
            (1 0 0 2)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (9 8 8 10)
            (11 9 10 12)
        );
    }
    wall
    {
        type wall;
        faces
        (
            (2 5 4 1)
            (7 12 11 6)
            (4 5 7 6)
        );
    }
    axis
    {
        type empty;
        faces
        (
            (0 3 3 0)
            (3 8 8 3)
        );
    }
    frontAndBack_pos
    {
        type wedge;
        faces
        (
            (2 0 3 5)
            (5 3 8 10)
            (7 5 10 12)
        );
    }


    frontAndBack_neg
    {
        type wedge;
        faces
        (
            (0 1 4 3)
            (3 4 9 8)
            (4 6 11 9)
        );
    }
);

// ************************************************************************* //
